[Обувь]Интервью со всемирно извеcтным и невероятно харизматичным дизайнером Кристианом Лубутеном.
В Москве открывается флагманский бутик Christian Louboutin и маэстро дал интервью для Buro 24/7.
Этот человек никогда не стеснялся играть с темой секса и всегда был верен каблукам. Его туфли с красными подошвами остаются желанными для любой женщины.
Его любовь к шпилькам проявилась после того как он увидел танцовщиц кабаре. Он захотел делать обувь для них. 
Вообще дизайнер считает очень эротичным - манеру скрывать все тело под одеждой и оголять щиколотки - а каблуки завершают лук в этом случае. 
Он все время повторяет что каблуки меняют сам силуэт женщины, контроль над телом и полностью преображает ее образ. Плюс к этому каблуки "звучат".
Первый эскиз был срисован дизайнером с предупредительного знака в музее, запрещающего носить каблуки еще в 1974 году.
Лубутен очень лояльно и увадительно относится и к обуви на плоской подошве, позволяя женщинам самим выбирать что им по душе - они ведь никому ничего не должны.
Среди тенденций последних лет Кристиан отмечает, что повысилось внимание к собственному телу, чему немало способствует интернет.
Лубутен рассуждает о цвете в моде. Отметил что России, как никакой другой стране, подходит белый цвет в сочетании с золотым. Ему также нравится черный - он стройнит, хотя он его не носит.
Кристиан Лубутен считает, что необходимо работать с настроением - от него все зависит. Конкретно же от настроя самого дизайнера зависит результат всей команды.
Подробнее читайте в статье.

[Компания]Об интернет магазине ASOS, созданном в начале 2000х годов Квентином Гриффитсом и Ником Робертсоном. Компания занимается производством недорогой модной одежды и реализует ее в интернете через свой сайт. Главный офис компании находится в Лондоне и этот интернет гигант рассылает по всему миру более чем 
35 млн посылок и размещает для продажи на своем сайте более 500 новых единиц товара ежедневно.
Секрет успеха компании заключается в слаженной работе всех ее подразделений - строго регламентируемых процессов создания одежды (от придумываения до пошива), подготовке позиции
к размещению на сайте, качественой логистике, которая в ответе за своевременную доставку.
Ядром компании являются дизайнерские студии - всего их двенадцать. Они поделены на мужские и женские. Здесь работают дизайнеры и они придумывают линии одежды, занимаются 
изобретением новых орнаментов, тканей, пошивом.
Для того чтобы, отснять новые позиции для размещения на сайте и демонстрации в ASOS есть постоянный штат моделей.
Стоит отметить, что целевой аудиторийей для интернет - магазина являются молодые люди в возрасте от 20ти лет, т.е. очень юные.
По поводу предстоящего сезона в компании считают, что будет преобладать спортивный стиль с обилием сетчатой ткани и нейлона.
Команда очень много работает для поддерржания инфраструктуры, безупречной работы интернет - магазина, вовремя устраняя возникающие баги и оперативно внося изменения на сайт.
А также, специалисты компании работают с возражениями клиентов, отвечая на комментарии в интернете.
Результаты такой работы на лица - рост акций более чем на 80% за год.

[Agile]В статье рассуждения о методологии разработки ПО Agile и ее применимости в больших от руководителя проектного офиса компании Phobos Алексей Прокопенко.
Сама суть гибкой методологии разработки довольна просто и предполагает возможность быстро подстроится под требование реалий и в кратчайшие сроки реализовать нужный функционал, требуемый рынку.
По мнению Прокопенко она совершенно неприменима в такой трактовке в больших компаниях, так как для того чтобы притворить какоето решение в жизнь - необходимо пройти множество бюрократических 
процедур по утвердждению того или иного изменения - что противоречит самой сути Agile. 
Основываясь на своем опыте работы в "Сбертехе" - подразделении Сбербанка и в Альфа-банке, Алексей описывает ситуации,
когда продукт даже не начал разрабатываться, а сроки сдачи его уже прошли. В качестве удачного примера реализации проекта в крупной компании он приводит "Сбербанк-онлайн". Его разработка была отдана на аутсорс внешней команде дизайнеров, которая была лишена необходимости в постоянном согласовании чего - либо с руковоством Сбербанка, и выполнила работу качественно и в срок.
Именно таким, он видит применение Agile - либо выделение команды в отдельное совершенно обособленное небольшое подразделение, либо передачу всей реализации продукта на аутсорсинг. Краеугольным камнем 
успешной работы по этой методологии является то, что она расчитана на небольшие команды.
К сожалению, в России, корректному использованию запданых методов работы мешают плохой инвестиционный климат - отсутсвие большого количество развитых бизнес - инкубаторов, бизнес-англелов, инвесторов - от
собственной практики разработки ПО у нас нет, а то что перенимается с запада иногда имплементируется неправильно  - как в случае Сбербанка и Agile.
В значительной степени это повлияло на решение Алексея перейти на работу в другую компанию, для того чтобы заниматься именно реализацией проектов, а не бесконечным согласованием чего бы то ни было.



