
[Agile]В статье рассуждения о методологии разработки ПО Agile и ее применимости в больших от руководителя проектного офиса компании Phobos Алексей Прокопенко.
Сама суть гибкой методологии разработки довольна просто и предполагает возможность быстро подстроится под требование реалий и в кратчайшие сроки реализовать нужный функционал, требуемый рынку.
По мнению Прокопенко она совершенно неприменима в такой трактовке в больших компаниях, так как для того чтобы притворить какоето решение в жизнь - необходимо пройти множество бюрократических 
процедур по утвердждению того или иного изменения - что противоречит самой сути Agile. 
Основываясь на своем опыте работы в "Сбертехе" - подразделении Сбербанка и в Альфа-банке, Алексей описывает ситуации,
когда продукт даже не начал разрабатываться, а сроки сдачи его уже прошли. В качестве удачного примера реализации проекта в крупной компании он приводит "Сбербанк-онлайн". Его разработка была отдана на аутсорс внешней команде дизайнеров, которая была лишена необходимости в постоянном согласовании чего - либо с руковоством Сбербанка, и выполнила работу качественно и в срок.
Именно таким, он видит применение Agile - либо выделение команды в отдельное совершенно обособленное небольшое подразделение, либо передачу всей реализации продукта на аутсорсинг. Краеугольным камнем 
успешной работы по этой методологии является то, что она расчитана на небольшие команды.
К сожалению, в России, корректному использованию запданых методов работы мешают плохой инвестиционный климат - отсутсвие большого количество развитых бизнес - инкубаторов, бизнес-англелов, инвесторов - от
собственной практики разработки ПО у нас нет, а то что перенимается с запада иногда имплементируется неправильно  - как в случае Сбербанка и Agile.
В значительной степени это повлияло на решение Алексея перейти на работу в другую компанию, для того чтобы заниматься именно реализацией проектов, а не бесконечным согласованием чего бы то ни было.


[ИТ]О том как работает дизайнерская студия Clay. С некоторых пор, компания, разрабатывающая интерфейсы переехала работать в США. Как имеонно строится производство, отношение к процессу работы над проектом, разнице между российскими и иностранными заказчиками читайте в статье.
Студия изначально основана и начала работу в Санкт-Петербурге и основана Антоном Зыкиным, Олегом Турбаба, Дмитрием Цозиком и Александром Хмелевским - выходцами из SFCD. Позже они открыли офисы в США ввиду того, что большая часть заказчиков - изза океана и присутствует необходимость в большом количестве личных встреч. Тем не менее большая часть дизайнеров находится в Санкт-Петербурге и вся компания управляется отсюда.
Специализация компании - нишевый бизнес-софт, хотя дизайнеры уже много поработали с гигантами вроде Google и Huawei.
В Clay существует свое мнение по поводу процесса ведения проекта. Выработана своя методология, которой команда четко следует. Основными этапами являются исследование, тесты, прототипы, производство, устранение проблем. Особенностью последних лет работы над дизайном стало создание подробных дизайн-спецификаций. Дизайн-спецификация состоит из нескольких документов: User Flow (сценарии взаимодействия), Style Guide (как выстроить элементы интерфеса, описание стиля), UI Kit (различные состояния элементов интерфейса).
В Clay есть свое мнение по поводу создания презентаций - ребята считаю что лучшим решением является рабочий прототип, хотя на практике все таки испольщуют скрины экраеов или видео, что тоже круто.
Говоря об американской аудитории вообще, в команде бытует мнение, что в Америке люди не так подкованиы технически как в России, это и есть преимущество, хотя на слузу какие либо русские дизайнерские компании не находятся.

Антоном Зыкиным, Олегом Турбаба, Дмитрием Цозиком и Александром Хмелевским clay sfcd 


[ИТ]Астро Теллер - глава структуры Х - инновационного подразделния Alphabet, занимающегося поиском и развитием перспективных проектов для Google, где сотрудники получают бонусы за отправку проектов в мусорку. Харизма главы инновационного крыла и перспективы, а также список начинаний подраздения, которые доросли до момента когда они смогли отправится в самостоятельное плавание - Chauffeur, Verily, Google Glass, GCam, Google Watch, Project Insight, Google Brain, Flux, Project Tango.
Астро очень серьезно относится к своей работе, он говорит что, его команда решает задачи, которые могут сделать мир лучше. Одна из задач подобного рода это обеспечение интернет-покрытием всей поверзности щемли. Дляэтого в подращделении придумали прикреплять передатчики к уоздушным гарам и "подвешивать" их в стратосфере. Проект называется Loon, но он еще не прошел все фильтры внутри подращделения, чтобы стать самостоятельным.
Были и гпомкие неудачи проектоав, рещультаты работы в которых вывели на рынок. Самый ищвестный проект это Google Glass. После вызода устройства нашлось огромное количество людей вощмутившизся покушением на свою свободу, будучи против того что из могут снимать незаметно для них. 
Другой перспективный проект касается популярной сейчас среди гигантов индустрии темы - беспилотные автомобили. В подразделении Х он называется Chauffeur и сейчас он уже оформлен в самостоятельное юридическое лицо.
Сам Теллер достаточно успешный предприниматель, хотя в его роду в основном все являются учеными. Он основпл компанию BodyMedia, проищводящую фитнес-браслеты. Компанию Теллер продал в 2013 году за сумму превышающую 100 млн долл.
http://www.rbc.ru/business/10/11/2016/58245d869a7947c7bcf37592
 
#эриктеллер #астротеллер #alphabet #google #bodymedia #chauffeur #verily #googleglass #gcam #googlewatch #projectinsight #googlebrain #flux #projecttango





